
* ETo Zone Final Zone
I have managed to recover the final_zones calculation, whew!

Note, we went up to 18 zones, in the total_move step, but we are pulling from
the 16th iteration.  Also, I am adding in some best colors for this as well.

#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql :results raw
  select fft.require_fft();
	create materialized view avg_0625.final_zone_parameters as
	with
	z(zones) as (
		select generate_series(1,16)
	),
	a as (
	 select zones,zone_id,eto,(fft(eto)).*
	 from avg_0625.total_move join z using (zones)
	 where iteration=5
	)
	select
	zones,
	zone_id,
	(e[1]*25)::integer as v,
	e[1]::decimal(3,1)||'_'||e[2]::decimal(3,1) as zone,
	e[1]::decimal(6,3) as p0,
	e[2]::decimal(6,3) as p1,
	d[2]::decimal(6,3) as h1,
	e[3]::decimal(6,3) as p2,
	d[3]::decimal(6,3) as h2,
  ifft(e,d,52) as ifft,
	eto
	from a
	order by 1;
#+END_SRC

#+RESULTS:
require_fft
SELECT 136


*** From GrassDB
The code below shows the method to extract the station data from the GrassDB.

#+BEGIN_SRC bash
# in GRASSDB/cimis/quinn
if (true); then
  vars=ETo,Tn,Tx,Tdew,Rs,Rso,Rnl,U2,K
  file=~/station_raster_data.csv
else # FAO_data
  vars=vars=FAO_ETo,FAO_Rso,K # for FAO data
  file=~/station_raster_fao_data.csv
fi
rm ${file}
echo x,y,station,date,$vars > ${file}
for m in 20??-??-??; do
  echo $m;
  v.out.ascii fs=' ' input=stations | cut -d' ' -f 1,2,4 |  sed -e "s/$/,$m/" |\
    r.what input=$(echo $vars | sed -e "s/,/@$m,/g" -e "s/$/@$m/") fs=',' >> ${file};
done
#+END_SRC

You can get the station data organized into proper arrays of eto by combining
all the values across all years.  We use the _station_eto_p_

#+BEGIN_SRC sql :engine postgresql :database eto_zones :results raw
create temp view wy_station_eto as
with a as (select
 CASE WHEN ((extract(month from ymd))::integer <10) THEN (extract(year from ymd))::integer ELSE
      (extract(year from ymd))::integer + 1 END as wy,
 (extract(month from ymd))::integer as month,
 (extract(day from ymd))::integer as day,
   station_id,s_eto
   from compare.ymd15
),b as (
 select station_id,wy,
 array_agg(s_eto order by CASE WHEN (month<10) THEN month+12 ELSE month END,day) as eto
 from a group by station_id,wy
)
select station_id,wy,array_length(eto,1) from b;
#+END_SRC

#+BEGIN_SRC sql :engine postgresql :database eto_zones :results raw
create view compare.station_eto_p as
with a as (select
 CASE WHEN ((extract(month from ymd))::integer <10) THEN (extract(year from ymd))::integer ELSE
      (extract(year from ymd))::integer + 1 END as wy,
 (extract(month from ymd))::integer as month,
 (extract(day from ymd))::integer as day,
   station_id,s_eto
   from compare.ymd15 ),
b as (
 select station_id,month,day,avg(s_eto) as eto from a group by station_id,month,day
),
c as (
 select station_id,array_agg(eto order by CASE WHEN (month<10) THEN month+12 ELSE month END,day) as eto
 from b group by station_id
)
select * from c where array_length(eto,1)=52;
#+END_SRC

#+RESULTS:
CREATE VIEW

*** Station Location
 First we need to calculate the pixel value for each station.

 #+header: :engine postgresql
 #+header: :database eto_zones
 #+BEGIN_SRC sql :results raw
 create view compare.station_xy as
 with p as (
	select station_id,
	st_transform(st_setsrid(
	st_makepoint(longitude,latitude),4326),3310) as pt
 from compare.station_info
 ),
 select station_id,pid,key,
 k.east,k.north,
 st_x(pt),st_y(pt),
 (floor((st_x(pt)-(-410000)) / 2000 ))::integer as x,
 (560-floor((st_y(pt) - (-660000)) / 2000))::integer as y
 from p join cimis_boundary on st_intersects(pt,boundary)
 join keys k using (pid);
 #+END_SRC

 #+RESULTS:
 CREATE VIEW

*** Station Best Zone

 This example shows how to get the best fitting zone for each station

	#+header: :engine postgresql
	#+header: :database eto_zones
	#+BEGIN_SRC sql :results raw
	select fft.require_fft();

	create materialized view compare.station_best_final_zone as
	with z as (
	 select zones,zone,
	 ifft(ARRAY[p0,p1,p2],ARRAY[0.0,h1,h2],52) as r
	from avg_0625.final_zone_parameters
	), w as (
	 select weight_id,w
	 from fft.weights
	 where weight_id=3
	),
	r as (
	 select station_id,zones,zone,
	 fft.w_rmse(r,s.eto,w) as rmse
	 from z,w,compare.station_eto_p s
	),
	m as (
	 select station_id,zones,zone,
	 min(rmse) OVER (partition by zones,station_id),
	 rmse
	 from r
	)
	select zones,station_id,zone,rmse
	from m
	where min=rmse;
	#+END_SRC

	#+RESULTS:
  require_fft

  SELECT 2448

	What if, instead, we wanted to see the RMSE for all the zones for each
	station, and then create a crosstab of those so we can put them in a shapefile
	for inclusion into a shapefile of station information.

	#+header: :engine postgresql
	#+header: :database eto_zones
	#+BEGIN_SRC sql :results raw
	 select fft.require_fft();
	 create temp view station_zone_rmse as
		 with z as (
		select zones,zone,
			ifft(ARRAY[p0,p1,p2],ARRAY[0.0,h1,h2],52) as r
			from avg_0625.final_zone_parameters
		 where zones=16
	 ),
	 w as (
		select weight_id,w
		from fft.weights
		where weight_id=3
	 ),
	r as (
		select station_id,zones,zone,
		fft.w_rmse(r,s.eto,w) as rmse
		from z,w,compare.station_eto_p s
	 )
   select station_id,zone,rmse
	 from r;

		create temp view all_zones as
    select zone from unnest(ARRAY['2.3_0.5','2.7_1.3',
    '3.0_1.8','3.1_2.5','3.3_2.1','3.4_2.7','3.8_2.3','3.8_2.9',
    '4.1_3.1','4.6_3.1','5.0_3.1','5.1_3.6','5.3_3.4','5.6_3.8',
    '6.1_4.1','6.6_4.3']::varchar[]) as z(zone);

		create table compare.station_zone_rmse_crosstab as
		select * from crosstab('select * from station_zone_rmse order by 1,2','select * from all_zones order by 1')
		ct(station_id int,"2.3_0.5" decimal(6,3),"2.7_1.3" decimal(6,3),"3.0_1.8" decimal(6,3),"3.1_2.5" decimal(6,3),"3.3_2.1" decimal(6,3),"3.4_2.7" decimal(6,3),"3.8_2.3" decimal(6,3),"3.8_2.9" decimal(6,3),"4.1_3.1" decimal(6,3),"4.6_3.1" decimal(6,3),"5.0_3.1" decimal(6,3),"5.1_3.6" decimal(6,3),"5.3_3.4" decimal(6,3),"5.6_3.8" decimal(6,3),"6.1_4.1" decimal(6,3),"6.6_4.3" decimal(6,3));

	#+END_SRC

	And Now, we want to create a station product that includes these RMSE errors,
	the raster, station, and lt values, the best fit zone and the raster zone.

	#+header: :engine postgresql
	#+header: :database eto_zones
	#+BEGIN_SRC sql :results raw
		select fft.require_fft();
		create table compare.station_qgis_results as
		with b as (
		select station_id,moved as raster,best as s_station
		from avg_0625.station_best_zone_in_zones where zones=16
		),
		i as (
		select station_id,name,
		st_setsrid(st_MakePoint(east,north),3310) as centroid
		from compare.station_info join compare.station_xy using (station_id)
		)
		select * from
		i join b using (station_id)
		join compare.lt_s_ratio e using (station_id)
		join compare.station_zone_rmse_crosstab r using (station_id)

#+END_SRC

#+RESULTS:
require_fft

SELECT 127
require_fft

require_fft

require_fft

require_fft

require_fft

require_fft

require_fft

**** Best Station Zone in each Zone
		 Then we can see what station zones are.  We want to look at the pre-move
		 version, the post-move version, and the station best fit.  We will look at this
		 for every set of picked and moved zones.  The view station_best_zone_in_zones
		 shows the raster selection of the best zone for each station in comparison to
		 the best zone from the station data for each set of zones.

		 #+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
		 select fft.require_fft();

		 create materialized view avg_0625.station_best_zone_in_zones as
		 with z(zones) as (
			 select generate_series(1,16)
		 ),
		 a as (
				select zones,station_id,st_value(r.rast,zones,x,y) as v
				from z,compare.station_xy as s, avg_0625.rasters r
				where run='avg_0625'
			 ),
		 m as (
			select zones,station_id,st_value(r.rast,zones,x,y) as v
			from z,compare.station_xy as s, avg_0625.rasters r
			where run='move'
		 )
		 select
			a.zones,station_id,
			aa.zone as picked,
			mm.zone as moved,
			b.zone as best
			from a join m using (zones,station_id)
			join compare.station_best_final_zone b using (zones,station_id)
			join avg_0625.final_zone_parameters aa on (a.zones=aa.zones and a.v=aa.zone_id)
			join avg_0625.final_zone_parameters mm on (m.zones=mm.zones and m.v=mm.zone_id)
			order by station_id;

		 #+END_SRC

		 #+RESULTS:
     require_fft

     SELECT 2432
     require_fft


**** Final Station Zones

 I'm honestly not sure this is still correct, I don't remember the numbers being
 so bad in the comparisons.

 #+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
 select fft.require_fft();

 create or replace view final_station_zones as
 with a as (
		select station_id,st_value(r.rast,16,x,y) as v
		from compare.station_xy as s, avg_0625.rasters r
		where run='avg_0625'
   ),
   m as (
		select station_id,st_value(r.rast,16,x,y) as v
		from compare.station_xy as s, avg_0625.rasters r
		where run='move'
   ),
   f as (
		select station_id,st_value(r.rast,1,x,y) as v
		from compare.station_xy as s, final_zones_raster r
   )
   select
   station_id,
   aa.zone as picked,
   mm.zone as moved,
   p.zone as final,
   b.zone as best
   from a join m using (station_id) join f using (station_id)
   join avg_0625.final_zone_parameters p on (f.v=p.v)
   join compare.station_best_final_zone b using (station_id)
   join avg_0625.final_zone_parameters aa on (a.v=aa.zone_id)
   join avg_0625.final_zone_parameters mm on (m.v=mm.zone_id)
   where p.zones=16 and b.zones=16 and aa.zones=16 and mm.zones=16
   order by station_id;

 #+END_SRC

 #+RESULTS:
 require_fft

 CREATE VIEW

**** Average Station Comparisons

 Alternatively, we could look at the predicted zone of the average of the
 stations in each zone.  This would sort of say how well the zone estimates the
 average of the stations within the zone.

 First, find the average eto, for all the stations within the zone.  This is what
 will be compared to the raster zones.  The compare.station_eto_z view shows the
 average eto for each set of stations in each zone for each set of zone classes.

 #+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
   create materialized view station_eto_zone_avg as
   with
     z(zones) as (
			select generate_series(1,16)
     ),
     m as (
			select zones,station_id,st_value(r.rast,zones,x,y) as zone_id
			from z,compare.station_xy as s, avg_0625.rasters r
			where run='move'
     ),
   a as (select
		CASE WHEN ((extract(month from ymd15))::integer <10) THEN (extract(year from ymd15))::integer ELSE
         (extract(year from ymd15))::integer + 1 END as wy,
		(extract(month from ymd15))::integer as month,
		(extract(day from ymd15))::integer as day,
			station_id,s_eto
			from compare.ymd15 ),
   b as (
		select zones,zone_id,month,day,count(*),avg(s_eto) as eto
		from a join m using (station_id)
		group by zones,zone_id,month,day
   ),
 -- min(count)/10 is about the number of stations
   c as (
		select zones,zone_id,(min(count)/10)::integer,array_agg(eto order by CASE WHEN (month<10) THEN month+12 ELSE month END,day) as eto
		from b group by zones,zone_id
   )
   select * from c where array_length(eto,1)=52;
 #+END_SRC

 #+RESULTS:
 SELECT 133

 And now that we have the average ETo zone value from each set of zones, we can
 compare the best fit average station values to the best fit

 #+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
     create or replace view station_eto_zone_avg_best as
     with z as (
			select zones,zone,
			ifft(ARRAY[p0,p1,p2],ARRAY[0.0,h1,h2],52) as r
     from avg_0625.final_zone_parameters
     ),
     w as (
			select weight_id,w
			from fft.weights
			where weight_id=3
     ),
     r as (
			select zones,zone,s.zone_id,
			fft.w_rmse(r,s.eto,w) as rmse
			from w,
			z join station_eto_zone_avg s using (zones)
     ),
     m as (
			select zones,zone,zone_id,
			min(rmse) OVER (partition by zones,zone_id),
			rmse
			from r
     )
     select zones,p.zone as raster_zone,m.zone as station_zone
     from m
     join avg_0625.final_zone_parameters p using (zones,zone_id)
     where min=rmse;

 #+END_SRC

 #+RESULTS:
 CREATE VIEW
 CREATE VIEW
 CREATE VIEW
 CREATE VIEW
 CREATE VIEW
 CREATE VIEW


*** Table creation
#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql :results raw
create materialized view compare.lt_15day_eto_p as
with d(doy) as (
 select * from generate_series(4,365,7)
)
select
station_id,
array_agg(eto order by case when (doy<277) then doy+365 else doy end) as eto
from compare.lt_15day join d using (doy)
group by 1
order by 1;
#+END_SRC

#+RESULTS:
SELECT 134

*** Station Location

 #+header: :engine postgresql
 #+header: :database eto_zones
 #+BEGIN_SRC sql :results raw
 create view compare.lt_15day_xy as
 with p as (
	select distinct station_id,
	st_transform(st_setsrid(
	st_makepoint(longitude,latitude),4326),3310) as pt
 from compare.lt_15day
 )
 select station_id,pid,key,
 k.east,k.north,
 st_x(pt),st_y(pt),
 (floor((st_x(pt)-(-410000)) / 2000 ))::integer as x,
 (560-floor((st_y(pt) - (-660000)) / 2000))::integer as y
 from p join cimis_boundary on st_intersects(pt,boundary)
 join keys k using (pid);
 #+END_SRC

 #+RESULTS:
 CREATE VIEW

*** Station Best Zone

 This example shows how to get the best fitting zone for each station

	#+header: :engine postgresql
	#+header: :database eto_zones
	#+BEGIN_SRC sql :results raw
	select fft.require_fft();

	create materialized view compare.lt_15day_best_final_zone as
	with
  z as (
	 select zones,zone,
	 ifft(ARRAY[p0,p1,p2],ARRAY[0.0,h1,h2],52) as r
	from avg_0625.final_zone_parameters
	), w as (
	 select weight_id,w
	 from fft.weights
	 where weight_id=3
	),
	r as (
	 select station_id,zones,zone,
	 fft.w_rmse(r,s.eto,w) as rmse
	 from z,w,compare.lt_15day_eto_p s
	),
	m as (
	 select station_id,zones,zone,
	 min(rmse) OVER (partition by zones,station_id),
	 rmse
	 from r
	)
	select zones,station_id,zone,rmse
	from m
	where min=rmse;
	#+END_SRC

	#+RESULTS:
  require_fft

  require_fft

  SELECT 2144
	require_fft

	SELECT 2144

<<<<<<< HEAD
=======
	Finally, somehow I have a table missing from this documentation.  It's

	#+header: :engine postgresql
	#+header: :database eto_zones
	#+BEGIN_SRC sql :results raw
		create view public.lt_station_zones as
		select s.station_id,z.zone,
		st_setsrid(st_makepoint(s.longitude,s.latitude),4369) as centriod
		from compare.station_info s
		join compare.lt_15day_best_final_zone z using (station_id)
		where z.zones=16;
	#+END_SRC

	#+RESULTS:
  CREATE VIEW
	CREATE VIEW
>>>>>>> 5444b07bd3785af812a5f6314cea412e9a724b84

**** Best Station Zone in each Zone
		 Then we can see what station zones are.  We want to look at the pre-move
		 version, the post-move version, and the station best fit.  We will look at this
		 for every set of picked and moved zones.  The view station_best_zone_in_zones
		 shows the raster selection of the best zone for each station in comparison to
		 the best zone from the station data for each set of zones.

		 #+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
		 select fft.require_fft();

		 create materialized view avg_0625.lt_15day_best_zone_in_zones as
		 with z(zones) as (
			 select generate_series(1,16)
		 ),
		 a as (
				select zones,station_id,st_value(r.rast,zones,x,y) as v
				from z,compare.station_xy as s, avg_0625.rasters r
				where run='avg_0625'
			 ),
		 m as (
			select zones,station_id,st_value(r.rast,zones,x,y) as v
			from z,compare.station_xy as s, avg_0625.rasters r
			where run='move'
		 )
		 select
			a.zones,station_id,
			aa.zone as picked,
			mm.zone as moved,
			b.zone as best
			from a join m using (zones,station_id)
			join compare.lt_15day_best_final_zone b using (zones,station_id)
			join avg_0625.final_zone_parameters aa on (a.zones=aa.zones and a.v=aa.zone_id)
			join avg_0625.final_zone_parameters mm on (m.zones=mm.zones and m.v=mm.zone_id)
			order by station_id;

		 #+END_SRC

		 #+RESULTS:
     require_fft

     SELECT 2128
		 require_fft

		 SELECT 2128

**** Final lt_15day Zones

 I'm honestly not sure this is still correct, I don't remember the numbers being
 so bad in the comparisons.

 #+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
 select fft.require_fft();

 create or replace view final_lt_15day_zones as
 with a as (
		select station_id,st_value(r.rast,16,x,y) as v
		from compare.lt_15day_xy as s, avg_0625.rasters r
		where run='avg_0625'
   ),
   m as (
		select station_id,st_value(r.rast,16,x,y) as v
		from compare.lt_15day_xy as s, avg_0625.rasters r
		where run='move'
   ),
   f as (
		select station_id,st_value(r.rast,1,x,y) as v
		from compare.lt_15day_xy as s, final_zones_raster r
   )
   select
   station_id,
   aa.zone as picked,
   mm.zone as moved,
   p.zone as final,
   b.zone as best
   from a join m using (station_id) join f using (station_id)
   join avg_0625.final_zone_parameters p on (f.v=p.v)
   join compare.lt_15day_best_final_zone b using (station_id)
   join avg_0625.final_zone_parameters aa on (a.v=aa.zone_id)
   join avg_0625.final_zone_parameters mm on (m.v=mm.zone_id)
   where p.zones=16 and b.zones=16 and aa.zones=16 and mm.zones=16
   order by station_id;

 #+END_SRC

 #+RESULTS:
 require_fft

 CREATE VIEW
 require_fft

 CREATE VIEW
 require_fft

 CREATE VIEW

**** Average lt_15day Comparisons

 Alternatively, we could look at the predicted zone of the average of the
 lt_15days in each zone.  This would sort of say how well the zone estimates the
 average of the lt_15days within the zone.

 First, find the average eto, for all the lt_15days within the zone.  This is what
 will be compared to the raster zones.  The compare.lt_15day_eto_z view shows the
 average eto for each set of lt_15days in each zone for each set of zone classes.

 #+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
   create materialized view lt_15day_eto_zone_avg as
   with
     z(zones) as (
			select generate_series(1,16)
     ),
     m as (
			select zones,station_id,st_value(r.rast,zones,x,y) as zone_id
			from z,compare.lt_15day_xy as s, avg_0625.rasters r
			where run='move'
     ),
   a as (select
		CASE WHEN ((extract(month from ymd15))::integer <10) THEN (extract(year from ymd15))::integer ELSE
         (extract(year from ymd15))::integer + 1 END as wy,
		(extract(month from ymd15))::integer as month,
		(extract(day from ymd15))::integer as day,
			station_id,s_eto
			from compare.ymd15 ),
   b as (
		select zones,zone_id,month,day,count(*),avg(s_eto) as eto
		from a join m using (station_id)
		group by zones,zone_id,month,day
   ),
 -- min(count)/10 is about the number of lt_15days
   c as (
		select zones,zone_id,(min(count)/10)::integer as count,array_agg(eto order by CASE WHEN (month<10) THEN month+12 ELSE month END,day) as eto
		from b group by zones,zone_id
   )
   select * from c where array_length(eto,1)=52;
 #+END_SRC

 #+RESULTS:

 And now that we have the average ETo zone value from each set of zones, we can
 compare the best fit average lt_15day values to the best fit

 #+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
     create or replace view lt_15day_eto_zone_avg_best as
     with z as (
			select zones,zone,
			ifft(ARRAY[p0,p1,p2],ARRAY[0.0,h1,h2],52) as r
     from avg_0625.final_zone_parameters
     ),
     w as (
			select weight_id,w
			from fft.weights
			where weight_id=3
     ),
     r as (
			select zones,zone,s.zone_id,
			fft.w_rmse(r,s.eto,w) as rmse
			from w,
			z join lt_15day_eto_zone_avg s using (zones)
     ),
     m as (
			select zones,zone,zone_id,
			min(rmse) OVER (partition by zones,zone_id),
			rmse
			from r
     )
     select zones,p.zone as raster_zone,m.zone as lt_15day_zone
     from m
     join avg_0625.final_zone_parameters p using (zones,zone_id)
     where min=rmse;

 #+END_SRC

 #+RESULTS:
 CREATE VIEW
 CREATE VIEW
 CREATE VIEW


* ETo modifications

I have been having a long term back and forth with DWR on the best possible
method to include the cimis lt_15day data into the ETo Zone Maps.  We have
had multiple discussions on what the best method to do this would be.  Bekele
has wanted to modify the ETo zone map values to include the ETo Station data. I
have been resistant to that, since I only thought it confused matters.

Recently, I've had a bit of an epiphany about how we might go about this.  Since
we have the ETo parameters for both the Stations, and for the underlying raster
data, what we can do is to calculate what the ratio is between the different
parameters that make up the ETo simplification.  That is, we can create ratios
between the p0, p0 and H0 values. We can then use a spline fit to spread these
ratios across all of CA. Using these updated values, we can then create a new
zone map, that uses these values to calculate the best fit for each zone.  From
that, we can then look at where the zones differ, and use that as an estimation
of where we are unclear about the estimations of ET from our station
perturbations.

I think this is a superior method for a number of reasons.  First, we can
compare to maps to really see where the differences of the two methods are, and
Secondly, if we really want to estimate something like the total change in ETo
from the two methods, then we can use these estimates way more reliably.  (In
fact, we can just look at the p0 maps :)

We used to station estimates, the station_* tables and the lt_15day_* tables.
The lt_15day tables from the [[file:NOTES.org::*DWR%20Long%20term%20average][DWR Long term average]] data, and their
calcutations.  This is the data that we want to use.  The FFT values for the
stations is compare.lt_15day_fft, as defined in [[file:NOTES.org::*Station%20FFT][Station FFT]].

 #+header: :engine postgresql
 #+header: :database eto_zones
 #+BEGIN_SRC sql :results raw
 select fft.require_fft();
select * from compare.lt_15day_fft
limit 4;
 #+END_SRC

 #+RESULTS:
 station_id	p0	p1	h1	p2	h2
 2	4.377	3.368	270	-0.098	-17.585
 5	3.907	2.918	269	-0.118	-36.357
 6	3.975	2.992	272	-0.033	-33.617
 7	3.846	3.041	269	-0.061	-19.140

Super! Now we want to compare this data with the raster long term averages. The
raster long term average data exists in the file, fft.raster_15avg_ed. There is
one for every pixel, we just need to join that to the station data. We created a
table for the station's associated pid from compare.station_xy that combines the
station_info w/ the cimis boundaries, so we can just use that. Note, however,
the lt_* data reports some stations considerably far from the station_info data.
We are assuming the station info is correct.

 #+header: :engine postgresql
 #+header: :database eto_zones
 #+BEGIN_SRC sql
 with a as (
 select *,
 st_distance(st_transform(st_setsrid(st_makepoint(longitude,latitude),4269),3310),
             st_setsrid(st_makepoint(st_x,st_y),3310)) as diff
 from compare.station_xy s
 join compare.lt_15day_ll lt using (station_id)
)
select station_id,longitude,latitude,diff::integer
from a
where diff > 500
order by diff desc;
#+END_SRC

#+RESULTS:
| station_id | longitude | latitude |  diff |
|------------+-----------+----------+-------|
|        135 |  -114.666 |   33.557 | 15431 |
|        196 |  -122.144 |   38.685 | 11337 |
|         88 |  -119.605 |   34.932 |  6388 |
|         84 |  -121.311 |   39.271 |  2088 |
|        152 |  -118.994 |   34.232 |  1407 |
|        114 |   -121.29 |   36.359 |  1305 |
|        170 |   -122.02 |   38.004 |  1264 |
|        194 |  -120.851 |   37.719 |   911 |
|        136 |  -116.154 |   33.516 |   868 |
|        175 |  -114.726 |   33.389 |   863 |
|         74 |  -116.973 |    33.09 |   758 |
|         56 |  -120.761 |   37.093 |   752 |
|         79 |  -122.421 |   38.549 |   698 |
|         62 |  -117.222 |    33.49 |   691 |
|         77 |   -122.41 |   38.434 |   614 |
|         90 |  -120.479 |   41.433 |   589 |
|        200 |  -116.258 |   33.746 |   553 |

Here's the raster Long_term ET parameters

#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql
 create view compare.r_ymd15_fft as
 select station_id,
 e[1] as p0,e[2] as p1,d[2] as h1,
 e[3] as p2,d[3] as h2
from compare.station_xy
join fft.raster_15avg_ed
using (pid);
#+END_SRC

#+RESULTS:
| CREATE VIEW |
|-------------|


okay we need the same data for the data from the Spatial CIMIS.  Well it
turns out we already have this data (at least the raw eto data) in the file
compare.ymd15.  This reads in data that was exported from the spatial cimis
data.  It's the station and raster data for all the points in time that stations
reported data for our calculations.

So we just need to calculate the station fft data (which we already have
somewhere, but we can calculate here.  Similar to the lt_15day_fft, we'll
calculate the compare.raster_station_fft as :

 #+header: :engine postgresql
 #+header: :database eto_zones
 #+BEGIN_SRC sql :results raw
select fft.require_fft();
create view compare.s_ymd15_fft as
with v as (
 select station_id,
 extract (month from ymd15) as m,
 extract (day from ymd15) as d,
 count(*) as count,
 avg(r_eto) as r_eto,
 avg(s_eto) as s_eto
 from compare.ymd15
 group by station_id,m,d
),
e as (
 select station_id,(avg(count))::decimal(4,1) as window_count,
 fft(array_agg(r_eto order by case when (m<10) then m+12 else m end)) as r_eto,
 fft(array_agg(s_eto order by case when (m<10) then m+12 else m end)) as s_eto
 from v
 group by station_id
)
select station_id,window_count,
(r_eto).e[1]::decimal(6,3) as r_p0,
(r_eto).e[2]::decimal(6,3) as r_p1,
(r_eto).d[2]::integer as r_h1,
--(r_eto).e[3]::decimal(6,3) as r_p2,
--(r_eto).d[3]::decimal(6,3) as r_h2,
(s_eto).e[1]::decimal(6,3) as s_p0,
(s_eto).e[2]::decimal(6,3) as s_p1,
(s_eto).d[2]::integer as s_h1
--(s_eto).e[3]::decimal(6,3) as s_p2,
--(s_eto).d[3]::decimal(6,3) as s_h2
from e;
#+END_SRC

 #+RESULTS:
 require_fft


Now, we need to calculate the ratios.  For the s_eto data, we'll use the raster
data calculated only for the same time frame.  For the long_term rasters, we'll
use the complete raster record.

#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql :results raw
create or replace view compare.lt_s_ratio as
with s as (
select
station_id,window_count as station_overlap_yrs,
r_p0 as s_r_p0,
r_p1 as s_r_p1,
s_p0 as s_p0,
s_p1 as s_p1,
(s_p0/r_p0)::decimal(6,3) as s_p0_ratio,
(s_p1/r_p1)::decimal(6,3) as s_p1_ratio
from compare.s_ymd15_fft
where window_count > 5
),
lt as (
select station_id,
r.p0::decimal(6,3) as r_p0,
r.p1::decimal(6,3) as r_p1,
lt.p0 as lt_p0,
lt.p1 as lt_p1,
(lt.p0/r.p0)::decimal(6,3) as lt_p0_ratio,
(lt.p1/r.p1)::decimal(6,3) as lt_p1_ratio
from compare.r_ymd15_fft r join
compare.lt_15day_fft lt using (station_id)
)
select station_id,
r_p0,r_p1,
lt_p0,lt_p1,
lt_p0_ratio,
lt_p1_ratio,
s.station_overlap_yrs,
s_r_p0,s_r_p1,
s_p0,s_p1,
s_p0_ratio,
s_p1_ratio
from s full outer join lt using (station_id)
#+END_SRC

#+RESULTS:

*** Best Modified Stations

Okay, so we've choosen the two ratios above to modify our ETo data. Let's get
that data into our postgres setup.


#+BEGIN_SRC bash
 # In grass
 cd ~/eto-zone-maps/station_comparison
 r.out.xyz separator=',' input=s_s0_z0.1_t7_p0,s_s0.02_z0.1_t5_p0 output=spline_ratios.csv
#+END_SRC

Now import these data

#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql :results raw
create temp table splines_in (
east integer,north integer,
"s0_z0.1_t7" float,"s0.02_z0.1_t5" float);
\COPY splines_in from splines_ratio.csv with csv

create table compare.p0_grass_input_spline_ratios as
select pid,'s0_z0.1_t7'::text as spline,"s0_z0.1_t7" as p0_ratio
from splines_in
join cimis_boundary using (east,north)
union
select pid,'s0.02_z0.1_t75'::text as spline,"s0.02_z0.1_t5" as p0_ratio
from splines_in
join cimis_boundary using (east,north);
#+END_SRC

And now let's find the best zone for the newly made pixels. This is how we do
that. We take the calculated, ftp values for each pixel, and then we multiply
the p0 value by the ratio in the p0_grass_input_spline_ratio table. We have a
new set or parameters. Then we just calculate the RMSE for these new data, for
each of the 16 parameters, and then take the lowest one, and we have our
modified zone.  The only trick here, is that this RMSE verision is on the ifft
of the ftp values, not the original data itself.

#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql :results raw
select fft.require_fft();

create materialized view compare.station_adjusted_pixel_zones as
with
p as ( -- p are the new (station corrected) pixel values
 select pid,
 spline,
 ifft(ARRAY[e[1]*p0_ratio,e[2],e[3]],d,52) as eto
 from
 fft.raster_15avg_ed join
 compare.p0_grass_input_spline_ratios using (pid)
),
d as ( -- Every zone,(per # zones), new_pixel, weights
 select pid,spline,zone,zones,
 unnest(z.eto) as z,
 unnest(p.eto) as p,
 unnest(w) as w
 from avg_0625.final_zone_parameters z
 cross join p
 cross join (select w from fft.weights where weight_id=3) as w
 where z.zones=16
),
r as ( -- r has all the RMSE per zone
 select pid,spline,zone,zones,sqrt(sum(w^2*(z-p)^2))/sum(w) as rmse
 from d
 group by pid,spline,zone,zones
),
n as (
 select pid,spline,zone,zones,rmse,
 min(rmse) OVER (partition by pid,spline) as min
 from r
)
select * from n where rmse=min;
#+END_SRC

#+RESULTS:
require_fft

SELECT 210536

OK, now we have these updated locations.  We need to do some things here, we
need to export the images.  Also, we need to see how many pixels have switched
in applying this ratio.

If we want to export, we want to include the clever pixel values, and we want to
add the colors too.  The best_final

#+BEGIN_SRC bash
psql -At -d eto_zones \
-c 'select east,north,v from cimis_boundary join compare.station_adjusted_pixel_zones using (pid) join avg_0625.final_zone_parameters using (zone,zones) where zones=16 and spline='s0_z0.1_t7' |\
 r.in.xyz separator='|' input=- method=min output=adjusted_zone type=CELL --overwrite
#+END_SRC

#+BEGIN_SRC bash
psql -At -d eto_zones \
-c 'select fft.require_fft(); select east,north,v from cimis_boundary join avg_0625.total_move_rmse_min c using (pid) join avg_0625.final_zone_parameters z using  (zone_id,zones) where zones=16' |\
 r.in.xyz separator='|' input=- method=min output=computed_zones type=CELL --overwrite
#+END_SRC

#+BEGIN_SRC bash
psql -At -d eto_zones -c 'select east,north,val from final_zones_pixels' |\
 r.in.xyz separator='|' input=- method=min output=final_zones type=CELL --overwrite
#+END_SRC

#+BEGIN_SRC bash
for i in final_zones computed_zones adjusted_zones; do
r.out.gdal input=$i output=$i.png format=PNG
done
#+END_SRC

This is how you can get the color value for each value

#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql :results raw
select fft.require_fft();
select
format('%s:%s:%s:%s',v,hex_to_int(substring(color,2,2)),
hex_to_int(substring(color,4,2)),hex_to_int(substring(color,6,2)))
from avg_0625.final_zone_parameters
join zone_colors using (zone)
where zones=16
order by v;
#+END_SRC

And this is how you can get a crosstab of the comparisons of the original and
adjusted zones

#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql :results raw
select fft.require_fft();
 create table compare.adjusted_crosstab as
 select * from crosstab('with a as (select z.zone as orig,n.zone as adj from avg_0625.total_move_rmse_min o join compare.station_adjusted_pixel_zones n using (pid,zones) join avg_0625.final_zone_parameters z using (zone_id,zones) where zones=16) select orig,adj,count(*) from a group by 1,2 order by 1,2','select distinct zone from avg_0625.final_zone_parameters where zones=16 order by 1')
 ct(zone text,"2.3_0.5" int,"2.7_1.3" int,"3.0_1.8" int,"3.1_2.5" int,"3.3_2.1" int,"3.4_2.7" int,"3.8_2.3" int,"3.8_2.9" int,"4.1_3.1" int,"4.6_3.1" int,"5.0_3.1" int,"5.1_3.6" int,"5.3_3.4" int,"5.6_3.8" int,"6.1_4.1" int,"6.6_4.3" int);
#+END_SRC

#+RESULTS:
require_fft

SELECT 16

** ETo Zone Data

I need to do a better job of finding the description of everything that Mui and
I did to calculate vector versions of our ETo Zones.  Also, how we got those
final data into our

#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql :results raw
Create view public.zone_colors as
select * from ( VALUES
('2.3_0.5','#002673'),
('2.7_1.3','#5290fa'),
('3.0_1.8','#7fb6f5'),
('3.1_2.5','#bef0ff'),
('3.3_2.1','#267300'),
('3.4_2.7','#38a800'),
('3.8_2.3','#98e600'),
('3.8_2.9','#a8a800'),
('4.1_3.1','#668000'),
('4.6_3.1','#734c00'),
('5.0_3.1','#895a44'),
('5.1_3.6','#a83800'),
('5.3_3.4','#e64c00'),
('5.6_3.8','#ffa200'),
('6.1_4.1','#ffd000'),
('6.6_4.3','#ffff00')) as colors(zone,color);
#+END_SRC

#+RESULTS:
CREATE VIEW

And now we can write a new table.

#+header: :engine postgresql
#+header: :database eto_zones
#+BEGIN_SRC sql :results raw
select fft.require_fft();
create temp view zone_map_color as
with z as (
 select p0::decimal(6,1)||'_'||p1::decimal(6,1) as zone,
 geom
 from final_zones
)
select zone,color,v,p0,p1,h1,p2,h2,st_asKML(geom) as boundary
from z join avg_0625.final_zone_parameters using (zone)
join zone_colors using (zone)
where zones=16;
\COPY (select * from zone_map_color) to ~/eto-zone-maps/zone_map_color.csv with csv header;
#+END_SRC

#+RESULTS:
require_fft

CREATE VIEW
COPY 220
CREATE VIEW


